# Pandas
Pandas is mainly used for data analysis. Pandas allows importing data from various file formats such as comma-separated values, JSON, SQL, Microsoft Excel. Pandas allows various data manipulation operations such as merging, reshaping, selecting, as well as data cleaning, and data wrangling features.

# Topics Coverd here
1) What are data frames.
2) What is data Series.
3) Different Operations in Pandas.

To know the funciton of the key word select the keyword or select in between paranthesis and press shift+tab.

In [3]:
# we import pandas and numpy library
# with pandas we convert the data from different formats so we can munuplate the data.imp
import pandas as pd
import numpy as np

In [4]:
df=pd.DataFrame(index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])
# np.arange to arange numbers from o to 20 ,reshape for reshape the array, index to name the indices and columns to name the comlumns

In [5]:
df.head()

     column1 column2 column3 column4
Row1     NaN     NaN     NaN     NaN
Row2     NaN     NaN     NaN     NaN
Row3     NaN     NaN     NaN     NaN
Row4     NaN     NaN     NaN     NaN
Row5     NaN     NaN     NaN     NaN

# To create a CSV file from the data we created from the code above.

In [14]:
df.to_csv('test.csv')

In [ ]:
# To access the elements
# 1).loc , 2).iloc
# .loc here loc is the short form of location.
# .iloc is the short form of index location.

In [22]:
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [23]:
type(df.loc['Row1'])

pandas.core.series.Series

In [24]:
df.iloc[0:2,0:2]
# this is same as indexing in numpy

      column1  column2
Row1        0        1
Row2        4        5

In [27]:
df['column1'].unique()
#.unique points our all the elements in the column or row.

array([ 0,  4,  8, 12, 16], dtype=int64)

In [29]:
df[['column1','column2']]
we can also select two columns here.

      column1  column2
Row1        0        1
Row2        4        5
Row3        8        9
Row4       12       13
Row5       16       17

In [57]:
df=pd.read_csv(r'C:\Users\Abhishek\Desktop\Kaggle\Titanic\test.csv')
# NEED to use r before the file location to import the file.

In [56]:
df.head()
# To print top 5 of the list.

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [13]:
df.tail()
# To print the bottom of the list.

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [6]:
df.info()
# This gives some extra info about the dataset.

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [7]:
df.describe()
# This describes some of the statistics of the data.

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

In [8]:
df['Pclass'].value_counts()
# This can be used to count the specific values in the specific row.

3    218
1    107
2     93
Name: Pclass, dtype: int64

In [19]:
df[df['Fare']>300]
# You can select the condition of the list or column and you can get the value form there. 
# 'Yay' you can use conditions to do EDA.
#  You have found the richest passenger on the titanic.

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
343,1235,1,"Cardeza, Mrs. James Warburton Martinez (Charlo...",female,58.0,0,1,PC 17755,512.3292,B51 B53 B55,C

In [20]:
df.corr()
# corr() is used to find the pairwise correlation between all columns of the dataframe.
# Null values and symbols are excluded while performing this operation.
# This is a very useful thing in the data you can find the correlation between different features.

             PassengerId    Pclass       Age     SibSp     Parch      Fare
PassengerId     1.000000 -0.026751 -0.034102  0.003818  0.043080  0.008211
Pclass         -0.026751  1.000000 -0.492143  0.001087  0.018721 -0.577147
Age            -0.034102 -0.492143  1.000000 -0.091587 -0.061249  0.337932
SibSp           0.003818  0.001087 -0.091587  1.000000  0.306895  0.171539
Parch           0.043080  0.018721 -0.061249  0.306895  1.000000  0.230046
Fare            0.008211 -0.577147  0.337932  0.171539  0.230046  1.000000

In [29]:
from io import StringIO,BytesIO

In [36]:
data=('col-1,col-2,col-3\n'
     'x,y,1\n'
     'a,b,2\n'
     'c,d,3\n')

In [37]:
type(data)

str

In [39]:
StringIO()

In [38]:
pd.read_csv(StringIO(data))

  col-1 col-2  col-3
0     x     y      1
1     a     b      2
2     c     d      3

In [41]:
pd.read_csv(StringIO(data),usecols=['col-1','col-2'])
# For choosing the columns.

  col-1 col-2
0     x     y
1     a     b
2     c     d

# Csv to Json.

In [46]:
df.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [64]:
df.to_json(r'C:\Users\Abhishek\Desktop\Kaggle\Titanic\test.csv')

PermissionError: [Errno 13] Permission denied: 'C:\\Users\\Abhishek\\Desktop\\Kaggle\\Titanic\\test.csv'

In [68]:
url='https://www.britannica.com/topic/Winners-of-the-Nobel-Prize-for-Physics-1856942'
nd=pd.read_html(url)

In [69]:
type(nd)

list